Autodesk.Revit.DB.EvaluatedParameter.AsDoubleInForgeStorageUnit
Provides access to the double precision number within the parameter,
converted to the Forge storage unit of the parameter's data type.
Remarks:
This method should only be used if the Definition's StorageType property returns that
the internal contents of the parameter is a double.
Returns:
The double value contained in the parameter quantified in its Forge storage unit.
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter.AsValueString(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FormatOptions)
Get the parameter value as a string with units.
doc:
The document to be used to obtain information about the parameter.
options:
Options for formatting the string.
Returns:
The string that represents the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter.AsValueString(Autodesk.Revit.DB.Document)
Get the parameter value as a string with units.
doc:
The document to be used to obtain information about the parameter.
Returns:
The string that represents the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.EvaluatedParameter.StorageType
The storage type describes the type that is used internally within the parameter to store its value.
Remarks:
The property will return one of the following possibilities: String, Integer, Double or ElementId.
Based on the value of this property the correct access and set methods should be used to retrieve
and set the parameter's data value.
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter.HasValue
This property is true when the parameter value was successfully obtained, false otherwise.
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter.Value
Evaluated value of the parameter.
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter.Definition
Definition of the parameter.
Since:
2024

Autodesk.Revit.DB.EvaluatedParameter
Hold the evaluated Autodesk.Revit.DB.ParameterValue and Autodesk.Revit.DB.EvaluatedParameter.Definition of a parameter.
Since:
2024